In [1]:
import pandas as pd
import getpass
from sqlalchemy import create_engine
from sqlalchemy import text

In [2]:
password = getpass.getpass("Введите пароль от PostgreSQL: ")

In [3]:
user = "postgres"        # имя пользователя PostgreSQL
host = "localhost"        # или IP сервера
port = "5432"             # стандартный порт PostgreSQL
database = "postgres"     # название твоей базы

connection_string = f"postgresql+psycopg2://{user}:{password}@{host}:{port}/{database}"

engine = create_engine(connection_string)
engine

Engine(postgresql+psycopg2://postgres:***@localhost:5432/postgres)

In [4]:
with engine.connect() as conn:
    result = conn.execute(text("SELECT 1"))
    print(result.scalar())

1

1. Вывести распределение (количество) клиентов по сферам деятельности, отсортировав результат по убыванию количества.

In [5]:
query = text("""
    SELECT job_industry_category, count(customer_id) as cnt_customers
    FROM customer
    group by job_industry_category
""")

df = pd.read_sql(query, engine)
df

  job_industry_category  cnt_customers
0           Argiculture            113
1                Retail            358
2         Manufacturing            799
3                   n/a            656
4              Property            267
5         Entertainment            136
6                    IT            223
7    Financial Services            774
8    Telecommunications             72
9                Health            602

2.Найти общую сумму дохода (list_price*quantity) по всем подтвержденным заказам за каждый месяц по сферам деятельности клиентов. Отсортировать результат по году, месяцу и сфере деятельности

In [6]:
query = text("""
select date_trunc('month', o.order_date::date) as month,c.job_industry_category, sum (oi.quantity*oi.item_list_price_at_sale) as revenue
from orders o
join order_items oi on oi.order_id=o.order_id
join customer c on c.customer_id=o.customer_id
where o.order_status='Approved'
group by date_trunc('month', o.order_date::date),c.job_industry_category
order by 1,2
""")

df_2 = pd.read_sql(query, engine)
df_2

                        month job_industry_category     revenue
0   2016-12-31 21:00:00+00:00           Argiculture   232148.25
1   2016-12-31 21:00:00+00:00         Entertainment   342541.22
2   2016-12-31 21:00:00+00:00    Financial Services  2032708.80
3   2016-12-31 21:00:00+00:00                Health  1570012.40
4   2016-12-31 21:00:00+00:00                    IT   604949.44
..                        ...                   ...         ...
115 2017-11-30 21:00:00+00:00         Manufacturing  1821976.00
116 2017-11-30 21:00:00+00:00              Property   654253.30
117 2017-11-30 21:00:00+00:00                Retail   862122.80
118 2017-11-30 21:00:00+00:00    Telecommunications   137207.62
119 2017-11-30 21:00:00+00:00                   n/a  1661867.60

[120 rows x 3 columns]

3.Вывести количество уникальных онлайн-заказов для всех брендов в рамках подтвержденных заказов клиентов из сферы IT. Включить бренды, у которых нет онлайн-заказов от IT-клиентов, — для них должно быть указано количество 0.

In [7]:
query = text("""
WITH pret AS (
    SELECT 
        o.order_id
    FROM customer c
    JOIN orders o 
        ON c.customer_id = o.customer_id
    WHERE c.job_industry_category = 'IT'
      AND o.order_status = 'Approved'
      AND o.online_order = TRUE
)
SELECT 
    p.brand,
    SUM(
        CASE 
            WHEN oi.order_id IN (SELECT order_id FROM pret) 
            THEN 1 ELSE 0 
        END
    ) AS cnt_it_orders
FROM product p
LEFT JOIN order_items oi 
    ON p.product_id = oi.product_id
GROUP BY p.brand
ORDER BY p.brand
""")

df_3 = pd.read_sql(query, engine)
df_3

            brand  cnt_it_orders
0                             44
1  Giant Bicycles            252
2  Norco Bicycles            276
3      OHM Cycles            353
4           Solex            296
5   Trek Bicycles            252
6        WeareA2B            228

4.Найти по всем клиентам: сумму всех заказов (общего дохода), максимум, минимум и количество заказов, а также среднюю сумму заказа по каждому клиенту. Отсортировать результат по убыванию суммы всех заказов и количества заказов. Выполнить двумя способами: используя только GROUP BY и используя только оконные функции. Сравнить результат.

1) только группировка

из плюсов - локаничный код, из минусов выводить можно только аггрегирующие функции.

In [8]:
query = text("""
SELECT
    c.customer_id,
    c.first_name,
    c.last_name,
    COUNT(o.order_id) AS orders_count,
    coalesce(SUM(oi.quantity * oi.item_list_price_at_sale),0) AS total_revenue,
    coalesce(MAX(oi.quantity * oi.item_list_price_at_sale),0)  AS max_order_value,
    coalesce(MIN(oi.quantity * oi.item_list_price_at_sale),0)  AS min_order_value,
    coalesce(AVG(oi.quantity * oi.item_list_price_at_sale),0) AS avg_order_value
FROM customer c
LEFT JOIN orders o 
    ON o.customer_id = c.customer_id
LEFT JOIN order_items oi
    ON oi.order_id = o.order_id
GROUP BY 
    c.customer_id,
    c.first_name,
    c.last_name
ORDER BY 
    total_revenue DESC,
    orders_count desc
""")

df_4 = pd.read_sql(query, engine)
df_4

,customer_id,first_name,last_name,orders_count,total_revenue,max_order_value,min_order_value,avg_order_value
0,2183,Jillie,Fyndon,14,136632.450,20056.60,1073.07,9759.461478
1,1597,Jeffry,Slowly,12,133657.060,20914.70,1720.70,11138.088196
2,941,Tye,Doohan,10,129789.945,20914.70,2115.02,12978.993896
3,1129,Hercule,,13,129189.490,19773.60,1743.72,9937.652438
4,637,Mercy,Wilsone,13,109334.740,17796.24,360.40,8410.364624
...,...,...,...,...,...,...,...,...
3995,3900,Garland,Wildsmith,0,0.000,0.00,0.00,0.000000
3996,3611,Uriah,Chantree,0,0.000,0.00,0.00,0.000000
3997,3828,Tessy,Beefon,0,0.000,0.00,0.00,0.000000
3998,3774,Elizabeth,Christy,0,0.000,0.00,0.00,0.000000
3999,3775,Avie,Cleator,0,0.000,0.00,0.00,0.000000

2. Только оконные функции.

Тут из плюсов, что можно легко добавить неаггрегированное поле, например адрес клиента или его работу.

Из минусов - один клиент множется в выводе из-за джоинов с заказами, пришлось делать еще одну оконку с нумерацией вывода по клиенту и дальше в финальном запросе брать только одну сроку.

In [9]:
query = text("""
             WITH calc AS (
    SELECT
        c.customer_id,
        c.first_name,
        c.last_name,
        SUM(oi.quantity * oi.item_list_price_at_sale)
            OVER (PARTITION BY c.customer_id) AS total_revenue,
        COUNT(o.order_id)
            OVER (PARTITION BY c.customer_id) AS orders_count,
        MAX(oi.quantity * oi.item_list_price_at_sale)
            OVER (PARTITION BY c.customer_id) AS max_order_value,
        MIN(oi.quantity * oi.item_list_price_at_sale)
            OVER (PARTITION BY c.customer_id) AS min_order_value,
        AVG(oi.quantity * oi.item_list_price_at_sale)
            OVER (PARTITION BY c.customer_id) AS avg_order_value,
        ROW_NUMBER() OVER (
            PARTITION BY c.customer_id
            ORDER BY c.customer_id
        ) AS rn
    FROM customer c
    LEFT JOIN orders o 
        ON o.customer_id = c.customer_id
    LEFT JOIN order_items oi
        ON oi.order_id = o.order_id
)
SELECT
    customer_id,
    first_name,
    last_name,
    orders_count,
    COALESCE(total_revenue,0) AS total_revenue_clean,
    COALESCE(max_order_value,0) AS max_order_value,
    COALESCE(min_order_value,0) AS min_order_value,
    COALESCE(ROUND(avg_order_value::numeric, 2), 0) AS avg_order_value
FROM calc
WHERE rn = 1
ORDER BY
    total_revenue_clean DESC,
    orders_count DESC
""")             
df_5 = pd.read_sql(query, engine)
df_5

,customer_id,first_name,last_name,orders_count,total_revenue_clean,max_order_value,min_order_value,avg_order_value
0,2183,Jillie,Fyndon,14,136632.470,20056.60,1073.07,9759.46
1,1597,Jeffry,Slowly,12,133657.060,20914.70,1720.70,11138.09
2,941,Tye,Doohan,10,129789.940,20914.70,2115.02,12978.99
3,1129,Hercule,,13,129189.484,19773.60,1743.72,9937.65
4,637,Mercy,Wilsone,13,109334.740,17796.24,360.40,8410.36
...,...,...,...,...,...,...,...,...
3995,3731,Jandy,Rodgers,0,0.000,0.00,0.00,0.00
3996,3732,Shawn,De Hooge,0,0.000,0.00,0.00,0.00
3997,3733,Shelden,Rodenburg,0,0.000,0.00,0.00,0.00
3998,3734,Trixi,Wickes,0,0.000,0.00,0.00,0.00
3999,3735,Cchaddie,Heffron,0,0.000,0.00,0.00,0.00

5. Найти имена и фамилии клиентов с топ-3 минимальной и топ-3 максимальной суммой транзакций за весь период (учесть клиентов, у которых нет заказов, приняв их сумму транзакций за 0).

In [10]:
query = text("""
WITH totals AS (
    SELECT
        c.customer_id,
        c.first_name,
        c.last_name,
        COALESCE(SUM(oi.quantity * oi.item_list_price_at_sale), 0) AS total_revenue
    FROM customer c
    LEFT JOIN orders o 
        ON o.customer_id = c.customer_id
    LEFT JOIN order_items oi
        ON oi.order_id = o.order_id
    GROUP BY c.customer_id, c.first_name, c.last_name
),
ranks AS (
    SELECT
        customer_id,
        first_name,
        last_name,
        total_revenue,
        DENSE_RANK() OVER (ORDER BY total_revenue ASC)  AS rnk_min,
        DENSE_RANK() OVER (ORDER BY total_revenue DESC) AS rnk_max
    FROM totals
)
SELECT
    customer_id,
    first_name,
    last_name,
    round(total_revenue::numeric,0) as total_revenue
FROM ranks
WHERE rnk_min <= 3
   OR rnk_max <= 3
ORDER BY total_revenue DESC
""")             
df_6= pd.read_sql(query, engine)
df_6

     customer_id first_name last_name  total_revenue
0           2183     Jillie    Fyndon       136632.0
1           1597     Jeffry    Slowly       133657.0
2            941        Tye    Doohan       129790.0
3           2532      Milli   Hubbert           71.0
4           3292     Hamlen  Slograve           60.0
..           ...        ...       ...            ...
507         3847      Erinn     Ewing            0.0
508         3775       Avie   Cleator            0.0
509         3774  Elizabeth   Christy            0.0
510         3828      Tessy    Beefon            0.0
511         3611      Uriah  Chantree            0.0

[512 rows x 4 columns]

6. Вывести только вторые транзакции клиентов (если они есть) с помощью оконных функций. Если у клиента меньше двух транзакций, он не должен попасть в результат.

In [11]:
query = text("""
WITH ordered AS (
    SELECT
        c.customer_id,
        c.first_name,
        c.last_name,
        o.order_id,
        o.order_date,
        ROW_NUMBER() OVER (
            PARTITION BY c.customer_id
            ORDER BY o.order_date
        ) AS rn
    FROM customer c
    JOIN orders o 
        ON o.customer_id = c.customer_id
)
SELECT
    customer_id,
    first_name,
    last_name,
    order_id,
    order_date
FROM ordered
WHERE rn = 2 
ORDER BY customer_id
""")             
df_7= pd.read_sql(query, engine)
df_7

      customer_id      first_name     last_name  order_id  order_date
0               1         Laraine     Medendorp     13424  2017-02-21
1               2             Eli       Bockman      6743  2017-06-11
2               3           Arlin        Dearle     15188  2017-03-24
3               4          Talbot                   14648  2017-06-18
4               5  Sheila-kathryn        Calton     19993  2017-04-28
...           ...             ...           ...       ...         ...
3439         3496           Danya      Burnyeat     18797  2017-04-02
3440         3497            Thia         O'Day     10493  2017-09-12
3441         3498            Lois       Abrahim     17866  2017-02-10
3442         3499         Shelton  Tewkesberrie      2433  2017-02-25
3443         3500            Josy       Fleeman     14870  2017-01-11

[3444 rows x 5 columns]

7. Вывести имена, фамилии и профессии клиентов, а также длительность максимального интервала (в днях) между двумя последовательными заказами. Исключить клиентов, у которых только один или меньше заказов.

In [12]:
query = text("""
WITH ordered AS (
    SELECT
        c.customer_id,
        c.first_name,
        c.last_name,
        c.job_industry_category,
        o.order_id,
        o.order_date,
        LAG(o.order_date) OVER (
            PARTITION BY c.customer_id
            ORDER BY o.order_date
        ) AS prev_date
    FROM customer c
    JOIN orders o 
        ON o.customer_id = c.customer_id
),
intervals AS (
    SELECT
        customer_id,
        first_name,
        last_name,
        job_industry_category,
        order_date,
        prev_date,
        (order_date::date - prev_date::date) AS diff_days
    FROM ordered
    WHERE prev_date IS NOT NULL      -- только если есть предыдущий заказ
)
SELECT
    customer_id,
    first_name,
    last_name,
    job_industry_category,
    MAX(diff_days) AS max_interval_days
FROM intervals
GROUP BY
    customer_id, first_name, last_name, job_industry_category
HAVING COUNT(*) >= 1                 -- фактически исключает клиентов с 1 заказом
ORDER BY max_interval_days DESC;
""")             
df_8= pd.read_sql(query, engine)
df_8

,customer_id,first_name,last_name,job_industry_category,max_interval_days
0,1584,Susanetta,,Manufacturing,357
1,1810,Royall,Terris,Manufacturing,330
2,2128,Gregorius,Cockram,Property,330
3,3316,Stoddard,Giacomoni,n/a,330
4,3156,Bearnard,Letixier,Financial Services,329
...,...,...,...,...,...
3439,1246,Ibrahim,Wibrew,n/a,1
3440,2327,Alie,Sowle,n/a,1
3441,474,Consolata,Clacson,Entertainment,1
3442,78,Arch,Van der Kruis,Argiculture,1
3443,922,Bekki,Ralston,Financial Services,0

8. Найти топ-5 клиентов (по общему доходу) в каждом сегменте благосостояния (wealth_segment). Вывести имя, фамилию, сегмент и общий доход. Если в сегменте менее 5 клиентов, вывести всех.

In [13]:
query = text("""
WITH totals AS (
    SELECT
        c.customer_id,
        c.first_name,
        c.last_name,
        c.wealth_segment,
        COALESCE(SUM(oi.quantity * oi.item_list_price_at_sale), 0) AS total_revenue
    FROM customer c
    LEFT JOIN orders o 
        ON o.customer_id = c.customer_id
    LEFT JOIN order_items oi
        ON oi.order_id = o.order_id
    GROUP BY 
        c.customer_id,
        c.first_name,
        c.last_name,
        c.wealth_segment
),
ranked AS (
    SELECT
        customer_id,
        first_name,
        last_name,
        wealth_segment,
        total_revenue,
        DENSE_RANK() OVER (
            PARTITION BY wealth_segment
            ORDER BY total_revenue DESC
        ) AS rnk
    FROM totals
)
SELECT
    customer_id,
    first_name,
    last_name,
    wealth_segment,
    total_revenue
FROM ranked
WHERE rnk <= 5
ORDER BY wealth_segment, total_revenue DESC
""")             
df_9= pd.read_sql(query, engine)
df_9

    customer_id first_name   last_name     wealth_segment  total_revenue
0          1597     Jeffry      Slowly  Affluent Customer     133657.060
1           941        Tye      Doohan  Affluent Customer     129789.945
2          2309       Herc    McIlhone  Affluent Customer     107476.690
3          3015    Queenie       Flips  Affluent Customer     106182.330
4          2914  Jessamine     Brazear  Affluent Customer      98618.770
5           637      Mercy     Wilsone     High Net Worth     109334.740
6           213   Lockwood      Exroll     High Net Worth      92405.180
7          3447     Linell                 High Net Worth      91450.180
8          2492   Gayelord      Lipman     High Net Worth      90493.060
9          2138     Jonell         Gon     High Net Worth      87555.700
10         2183     Jillie      Fyndon      Mass Customer     136632.450
11         1129    Hercule                  Mass Customer     129189.490
12         1329      Wendy  Randlesome      Mass Customer     101439.060
13         2046     Charis        Maas      Mass Customer     100891.350
14         2615   Cordelia                  Mass Customer      99880.690